#define _CRT_SECURE_NO_WARNINGS 1
//DAY 5:
#include<stdio.h>
//#include<string.h>

//int main()
//{
//	char a[] = "abc";
//	char b[] = { 'a','b','c' ,0};
//	printf("%d\n", strlen(a));
//	printf("%d\n", strlen(b));
//	return 0;
//	//strlen-string length-¼ÆËã×Ö·û´®³¤¶È£¬ÐèÒªµ÷ÓÃstring.h
//	// ¼üÅÌÉÏÄÜÇÃ³öµÄËùÓÐ¶«Î÷¶¼ÊÇ×Ö·û£¬¶¼¶ÔÓ¦×ÅÏàÓ¦µÄASCIIÂëÖµ
//	//×ªÒå×Ö·û-\t-Ë®Æ½ÖÆ±í·û£¬
//	//\ddd-±íÊ¾Ò»¸ö×ªÒå×Ö·û£¬Ò»µ½Èý¸ö°Ë½øÖÆÊý×Ö£¬Òª½«Æä×ª»¯ÎªÊ®½øÖÆÔÙÓëASCIIÂë±íµÄ×Ö·ûÏà¶ÔÓ¦¡£\xdd,dd±íÊ¾Á½¸öÊ®Áù½øÖÆÊý×Ö
//
//}

//
//#include<stdio.h>
//
//
//int main()
//{
//	int line = 0;
//	while (line < 200000)
//
//	{
//
//		printf("ÇÃÒ»ÐÐ´úÂë£¬ÏÖÔÚÊÇµÚ%dÐÐ\n", line);
//		line++;
//	}
//	printf("ºÃoffer");

	/*int input=0;
	printf("Study hard or not?(1/0)\n");
	scanf("%d", &input);
	if (input == 1)
		printf("Good offers\n");
	else
		printf("Selling fruits at home.");*/
//
//	return 0;
//
//}
//¶¨Òåº¯Êý£º
//#include<stdio.h>
//º¯Êý·ÖÎªÁ½ÖÖ£¬¿âº¯ÊýºÍ×Ô¶¨Òåº¯Êý£¬ÏÂÊ¾Îª×Ô¶¨Òåº¯Êý-Éè¼Æ

//int ADD(int x, int y)//参数放在函数（)内加以定义
//{
//	int z = x + y;
//	return z;
//}
//int main()
//{
//	int num1 , num2 , sum;
//	scanf("%d%d", &num1,& num2);
//	sum = ADD(num1, num2);
//	printf("sum=%d", sum);
//	
//	return 0;
//}

//Êý×é£ºÒ»×éÏàÍ¬ÀàÐÍÔªËØµÄ¼¯ºÏ 
//int main()
//{
//	int group[10] = {1,2,3,4,5,6,7,8,9,10};//¶¨ÒåÒ»¸ö´æ·ÅÊ®¸öÕûÊýÊý×ÖµÄÊý×é,ÏÂ±ê´Ó0¿ªÊ¼,µÚÒ»¸öÊýÏÂ±êÎª0£¬ÓÃÏÂ±ê¿É·ÃÎÊÔªËØ£¨´´½¨µÄ±ê¼ÇÃû[n],±íÊ¾µÚn+1¸öÔªËØ£©
//	/*printf("%d", group[4]);*/
//	//char ch[20];//20¸ö×Ö·û
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d ", group[i]);
//		i++;
//	}
//	return 0;
//	
//}
//È¡Ä£²Ù×÷·û
int main()
{
	int a = 5 | 2;
	printf("%d", a);
	return 0;

}
//ÒÆ(2½øÖÆ)Î»²Ù×÷·û
//int main()
//{
//	int a = 1;//ÕûÐÎ1Õ¼4¸ö×Ö½Ú32bitÎ»£¬00000000000000000000000000000001£¬<<×óÒÆ£¬>>ÓÒÒÆ£¬ÊÇ½«Õû¸ö32±ÈÌØÎ»ÖÐµÄÊý×óÒÆ£¬Òç³öµÄ¶ªÆú£¬¿ÕÈ±µÄÓÃ0²¹Î»
//	int b = a << 2;//Ë«´óÐ¡µÈºÅºó¼ÓµÄÊý×Ö±íÊ¾ÒÆÎ»¸öÊý
//	printf("%d", b);
//	return 0;
//}
//int main()
//{
//	//£¨2½øÖÆ£©Î»²Ù×÷
//	//&-°´Î»Óë
//	//|°´Î»»ò
//	//^°´Î»Òà»ò
//	int a = 2;     //011 000 010
//	int b = 6;     //101 100 110
//	int c = a & b; //001 000 010
//	int d = a | b;
//	int e = a ^ b;
//	//°´Î»Óë£¨&£©ÏàÒìÎ»×÷0,ÏàÍ¬Î»±£Áô£¬ÕæÕæ²ÅÕæ£¬Õæ¼ÙÎª¼Ù£¬¼Ù¼Ù»¹ÊÇ¼Ù£¬1Õæ0¼Ù£¬Ïàµ±ÓÚÊýÑ§ÖÐµÄÇÒ
//	//°´Î»»òÏàµ±ÓÚÊýÑ§ÖÐµÄ»ò
//	//°´Î»Òà»ò¶þ½øÖÆÎ»ÏàÍ¬¼´Îª0£¬ÏàÒì¼´Îª1
//	//=¸³Öµ£¬==ÅÐ¶ÏÏàµÈ
//	//a=a()b/n£»Óëa(£©=£»µÈÐ§£¬¸Ã¸³Öµ·ûÎª¸´ºÏ¸³Öµ·û
//	//ÓÐ¼¸¸ö²Ù×÷Êý¾ÍÊÇ¼¸Ä¿²Ù×÷·û£¬µ¥--£¡£¬£¨£¡£©±íÊ¾Âß¼­·´²Ù×÷£¬0ÊÇ¼ÙÖµ£¬Ò»ÇÐ·Ç0¾ÍÊÇÕæÖµ£¬±íÊ¾Õæ£¬²»Ò»¶¨ÊÇ1Å¶¡£0·´²Ù×÷Ä¬ÈÏÎª1¡£sizeof¼ÆËã±äÁ¿»òÕßÀàÐÍËùÕ¼×Ö½ÚÊý
//
//	printf("%d%d%d", c,d,e);
//
//	return 0;
//}
//int main()
//{
//	int g1[9] = { 0 }, num;
//	num = sizeof(g1) / sizeof(g1[1]);//Ò»¸ö¼ÆËãÊý×é¸öÊýµÄ·½·¨£¬×ÜÕ¼ÄÚ´æ×Ö½Ú³ýÒÔÒ»¸öÄÚ´æ×Ö½Ú
//	printf("%d", num);
//	/*int i = 0;
//	while (i < 9)
//	{
//		printf("%d", g1[i]);
//		i += 1;
//	}*/
//	return 0;
//
//}

//DAY 6:



